//1.
//Пример тел број: +389 78 123-456, +389 2 321/123
//задача: ^\+389\s?([2-7]\d)[\s\-/]?(\d{3})[\s\-/]?(\d{3})$

//2.
// Пример матичен: 1205990410012
//задача: ^\d{13}$

//3.
//Пример таблица: SK-1234-AB, BT-987-AC
//задача: ^[A-Z]{2}-\d{3,4}-[A-Z]{2}$

//4.
// Пример маил: primer.ime@domain.com.mk
//задача: ^[a-zA-Z0-9_.+-]+@[a-zA-Z0-9-]+\.[a-zA-Z0-9-.]+$

//5.
//Пример веб адреса: http://www.regexr.com,
//задача: ^(https:\/\/)?(www\.)?([a-zA-Z0-9-]+\.)+[a-zA-Z]{2,3}$

//6.
//Пример ием на слика: mojata-slika.jpg, letuvanje_2023.png, logo.gif
//задача: ^[a-zA-Z0-9_-]+\.(jpg|jpeg|png|gif)$

//7.
//Пример текст на кирилица: Ова е пример, Скопје
//задача: ^[\u0400-\u04FF\s]+$
//\u0400-\u04FF: Ова е Unicode за сите кирилични букви 

//8.
//Пример за корисничко име: user_123, test-user
//задача: ^[a-zA-Z0-9_-]{3,16}$

//9.
//Пример youtube ид: dQw4w9WgXcQ, _Yhyp-_hX2s
//задача: ^[a-zA-Z0-9_-]{11}$

//10.
//Пример лозинка: lozinka123, 123lozinka, Password99
//задача: ^[a-zA-Z0-9]{8,24}$






















